monitoring/k6/last-300k-result.txt
RUN_ID=k6-300k-20260522235508
BASE_URL=http://[::1]:8080
TOTAL_ORDERS=300000
VUS=300
MAX_DURATION=60m
MAX_ATTEMPTS=10
RETRY_DELAY_SECONDS=2
REQUEST_TIMEOUT=5s
START=2026-05-23T05:57:56.460Z
END=2026-05-23T05:57:56.460Z
     ✓ order eventually accepted
     ✓ order finished within retry budget

     attempts_per_order.............: avg=1.014    min=1      med=1        p(90)=1        p(95)=1        p(99)=1        max=10     
   ✓ checks.........................: 100.00% ✓ 600000      ✗ 0     
     data_received..................: 164 MB  976 kB/s
     data_sent......................: 101 MB  603 kB/s
   ✓ final_order_failed.............: 0.00%   ✓ 0           ✗ 300000
     http_req_blocked...............: avg=11.57µs  min=0s     med=0s       p(90)=0s       p(95)=0s       p(99)=517.4µs  max=34.14ms
     http_req_connecting............: avg=7.17µs   min=0s     med=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=34.14ms
   ✓ http_req_duration..............: avg=137.29ms min=0s     med=134.81ms p(90)=219.54ms p(95)=252ms    p(99)=347.61ms max=1.01s  
       { expected_response:true }...: avg=139.17ms min=5.29ms med=135.47ms p(90)=220.37ms p(95)=252.64ms p(99)=348.66ms max=1.01s  
     http_req_failed................: 1.38%   ✓ 4200        ✗ 300000
     http_req_receiving.............: avg=135.22µs min=0s     med=0s       p(90)=525.5µs  p(95)=719.6µs  p(99)=1.51ms   max=31.82ms
     http_req_sending...............: avg=16.28µs  min=0s     med=0s       p(90)=0s       p(95)=0s       p(99)=531.4µs  max=31.15ms
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s     
     http_req_waiting...............: avg=137.14ms min=0s     med=134.67ms p(90)=219.39ms p(95)=251.81ms p(99)=347.47ms max=1.01s  
     http_reqs......................: 304200  1816.053407/s
     iteration_duration.............: avg=167.38ms min=5.6ms  med=135.76ms p(90)=221.61ms p(95)=254.81ms p(99)=363.59ms max=18.47s 
     iterations.....................: 300000  1790.979691/s
     recovered_orders...............: 600     3.581959/s
     retry_attempts.................: 4200    25.073716/s
     vus............................: 300     min=300       max=300 
     vus_max........................: 300     min=300       max=300