monitoring/k6/last-50k-db-chaos-result.txt
RUN_ID=db-chaos-50k-20260530191720
BASE_URL=http://api-gateway:8080
TOTAL_ORDERS=100000
VUS=200
MAX_DURATION=10m
MAX_ATTEMPTS=150
RETRY_DELAY_SECONDS=2
REQUEST_TIMEOUT=5s
ITERATION_DELAY_SECONDS=0
START=2026-05-30T19:18:08.895Z
END=2026-05-30T19:18:08.896Z
     ✓ order eventually accepted
     ✓ order finished within retry budget

     attempts_per_order.............: avg=1       min=1       med=1       p(90)=1        p(95)=1        p(99)=1        max=1       
   ✓ checks.........................: 100.00% ✓ 200000      ✗ 0     
     data_received..................: 47 MB   1.0 MB/s
     data_sent......................: 36 MB   789 kB/s
   ✓ final_order_failed.............: 0.00%   ✓ 0           ✗ 100000
     http_req_blocked...............: avg=30.41µs min=534ns   med=2.96µs  p(90)=4.68µs   p(95)=5.78µs   p(99)=174.16µs max=47.43ms 
     http_req_connecting............: avg=12.09µs min=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=113.29µs max=27.61ms 
   ✓ http_req_duration..............: avg=90.22ms min=11.63ms med=85.68ms p(90)=153.55ms p(95)=186.9ms  p(99)=265.59ms max=814.04ms
       { expected_response:true }...: avg=90.22ms min=11.63ms med=85.68ms p(90)=153.55ms p(95)=186.9ms  p(99)=265.59ms max=814.04ms
     http_req_failed................: 0.00%   ✓ 0           ✗ 100000
     http_req_receiving.............: avg=99.8µs  min=9.19µs  med=58.62µs p(90)=172.77µs p(95)=264.56µs p(99)=732.47µs max=28.83ms 
     http_req_sending...............: avg=22.02µs min=2.51µs  med=12.12µs p(90)=31.22µs  p(95)=42.28µs  p(99)=108.58µs max=43.14ms 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...............: avg=90.09ms min=11.53ms med=85.56ms p(90)=153.45ms p(95)=186.76ms p(99)=265.42ms max=813.93ms
     http_reqs......................: 100000  2208.198613/s
     iteration_duration.............: avg=90.44ms min=11.72ms med=85.88ms p(90)=153.82ms p(95)=187.24ms p(99)=265.75ms max=814.19ms
     iterations.....................: 100000  2208.198613/s
     vus............................: 200     min=200       max=200 
     vus_max........................: 200     min=200       max=200 
     ✓ order eventually accepted
     ✓ order finished within retry budget

     attempts_per_order.............: avg=1       min=1       med=1       p(90)=1        p(95)=1        p(99)=1        max=1       
   ✓ checks.........................: 100.00% ✓ 200000      ✗ 0     
     data_received..................: 47 MB   1.0 MB/s
     data_sent......................: 36 MB   789 kB/s
   ✓ final_order_failed.............: 0.00%   ✓ 0           ✗ 100000
     http_req_blocked...............: avg=30.41µs min=534ns   med=2.96µs  p(90)=4.68µs   p(95)=5.78µs   p(99)=174.16µs max=47.43ms 
     http_req_connecting............: avg=12.09µs min=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=113.29µs max=27.61ms 
   ✓ http_req_duration..............: avg=90.22ms min=11.63ms med=85.68ms p(90)=153.55ms p(95)=186.9ms  p(99)=265.59ms max=814.04ms
       { expected_response:true }...: avg=90.22ms min=11.63ms med=85.68ms p(90)=153.55ms p(95)=186.9ms  p(99)=265.59ms max=814.04ms
     http_req_failed................: 0.00%   ✓ 0           ✗ 100000
     http_req_receiving.............: avg=99.8µs  min=9.19µs  med=58.62µs p(90)=172.77µs p(95)=264.56µs p(99)=732.47µs max=28.83ms 
     http_req_sending...............: avg=22.02µs min=2.51µs  med=12.12µs p(90)=31.22µs  p(95)=42.28µs  p(99)=108.58µs max=43.14ms 
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...............: avg=90.09ms min=11.53ms med=85.56ms p(90)=153.45ms p(95)=186.76ms p(99)=265.42ms max=813.93ms
     http_reqs......................: 100000  2208.198613/s
     iteration_duration.............: avg=90.44ms min=11.72ms med=85.88ms p(90)=153.82ms p(95)=187.24ms p(99)=265.75ms max=814.19ms
     iterations.....................: 100000  2208.198613/s
     vus............................: 200     min=200       max=200 
     vus_max........................: 200     min=200       max=200 
running (00m45.3s), 000/200 VUs, 100000 complete and 0 interrupted iterations
create_orders_resilient ✓ [ 100% ] 200 VUs  00m45.3s/10m0s  100000/100000 shared iters
K6_EXIT_CODE=0
K6_ELAPSED_SECONDS=46.58
END=2026-05-30T19:18:09.532Z