monitoring/k6/last-50k-db-chaos-result.txt
RUN_ID=db-chaos-50k-20260602040933
BASE_URL=http://192.168.0.101:8080
TOTAL_ORDERS=50000
VUS=200
MAX_DURATION=10m
MAX_ATTEMPTS=150
RETRY_DELAY_SECONDS=2
REQUEST_TIMEOUT=5s
ITERATION_DELAY_SECONDS=0
START=2026-06-02T04:10:28.376Z
END=2026-06-02T04:10:28.376Z
     ✓ order eventually accepted
     ✓ order finished within retry budget

     attempts_per_order.............: avg=1        min=1      med=1       p(90)=1        p(95)=1        p(99)=1        max=1      
   ✓ checks.........................: 100.00% ✓ 100000      ✗ 0    
     data_received..................: 24 MB   474 kB/s
     data_sent......................: 18 MB   360 kB/s
   ✓ final_order_failed.............: 0.00%   ✓ 0           ✗ 50000
     http_req_blocked...............: avg=129.72µs min=506ns  med=1.85µs  p(90)=3.78µs   p(95)=4.32µs   p(99)=14.09µs  max=82.85ms
     http_req_connecting............: avg=126.96µs min=0s     med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=82.81ms
   ✓ http_req_duration..............: avg=198.95ms min=7.02ms med=95.17ms p(90)=529.54ms p(95)=663.02ms p(99)=953.45ms max=1.94s  
       { expected_response:true }...: avg=198.95ms min=7.02ms med=95.17ms p(90)=529.54ms p(95)=663.02ms p(99)=953.45ms max=1.94s  
     http_req_failed................: 0.00%   ✓ 0           ✗ 50000
     http_req_receiving.............: avg=40.01µs  min=7.82µs med=32.94µs p(90)=64.26µs  p(95)=84.17µs  p(99)=132.49µs max=2.27ms 
     http_req_sending...............: avg=12.05µs  min=2.3µs  med=7.72µs  p(90)=20.93µs  p(95)=27.07µs  p(99)=63.41µs  max=2ms    
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s     
     http_req_waiting...............: avg=198.9ms  min=6.97ms med=95.12ms p(90)=529.51ms p(95)=662.97ms p(99)=953.21ms max=1.94s  
     http_reqs......................: 50000   1001.682491/s
     iteration_duration.............: avg=199.22ms min=7.12ms med=95.29ms p(90)=529.86ms p(95)=663.15ms p(99)=958ms    max=1.95s  
     iterations.....................: 50000   1001.682491/s
     vus............................: 200     min=200       max=200
     vus_max........................: 200     min=200       max=200
     
     http_req_waiting...............: avg=198.9ms  min=6.97ms med=95.12ms p(90)=529.51ms p(95)=662.97ms p(99)=953.21ms max=1.94s  
     http_reqs......................: 50000   1001.682491/s
     iteration_duration.............: avg=199.22ms min=7.12ms med=95.29ms p(90)=529.86ms p(95)=663.15ms p(99)=958ms    max=1.95s  
     iterations.....................: 50000   1001.682491/s
     vus............................: 200     min=200       max=200
     vus_max........................: 200     min=200       max=200
running (00m49.9s), 000/200 VUs, 50000 complete and 0 interrupted iterations
create_orders_resilient ✓ [ 100% ] 200 VUs  00m49.9s/10m0s  50000/50000 shared iters
K6_EXIT_CODE=0
K6_ELAPSED_SECONDS=51.4
END=2026-06-02T04:10:28.988Z